; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	spectrograph2 - mode
	image3 - mode
	spectrograph1 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 image3)
	(calibration_target instrument1 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star2)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star1)
	(supports instrument6 infrared0)
	(supports instrument6 image3)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph2)
	(supports instrument8 image3)
	(calibration_target instrument8 Star2)
	(supports instrument9 image3)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star2)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star6)
)
(:goal (and
	(pointing satellite1 Star2)
	(pointing satellite2 Star4)
	(have_image Star3 image3)
	(have_image Star4 spectrograph1)
	(have_image Planet5 spectrograph2)
	(have_image Star6 spectrograph2)
	(have_image Star8 spectrograph2)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 image3)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 image3)
	(have_image Planet14 image3)
	(have_image Planet15 image3)
	(have_image Planet16 spectrograph2)
	(have_image Planet17 image3)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 15
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 15
3. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 15
4. (turn_to satellite4 phenomenon11 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 15
5. (turn_to satellite4 star2 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 star2)
   goals met: 0 of 15
6. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 0 of 15
7. (turn_to satellite4 phenomenon11 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 15
8. (take_image satellite4 phenomenon11 instrument10 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 1 of 15
9. (turn_to satellite4 phenomenon9 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 15
10. (take_image satellite4 phenomenon9 instrument10 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 2 of 15
11. (turn_to satellite4 star4 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star4)
   goals met: 2 of 15
12. (take_image satellite4 star4 instrument10 spectrograph1)
   added: (have_image star4 spectrograph1)
   goals met: 3 of 15
13. (turn_to satellite2 star1 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star1)
   goals met: 3 of 15
14. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 3 of 15
15. (turn_to satellite2 planet10 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet10)
   goals met: 3 of 15
16. (take_image satellite2 planet10 instrument6 image3)
   added: (have_image planet10 image3)
   goals met: 4 of 15
17. (turn_to satellite2 planet14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet14)
   goals met: 4 of 15
18. (take_image satellite2 planet14 instrument6 image3)
   added: (have_image planet14 image3)
   goals met: 5 of 15
19. (turn_to satellite2 planet15 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet15)
   goals met: 5 of 15
20. (take_image satellite2 planet15 instrument6 image3)
   added: (have_image planet15 image3)
   goals met: 6 of 15
21. (turn_to satellite2 planet17 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet17)
   goals met: 6 of 15
22. (take_image satellite2 planet17 instrument6 image3)
   added: (have_image planet17 image3)
   goals met: 7 of 15
23. (turn_to satellite2 star12 planet17)
   deleted: (pointing satellite2 planet17)
   added: (pointing satellite2 star12)
   goals met: 7 of 15
24. (take_image satellite2 star12 instrument6 image3)
   added: (have_image star12 image3)
   goals met: 8 of 15
25. (turn_to satellite2 star3 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star3)
   goals met: 8 of 15
26. (take_image satellite2 star3 instrument6 image3)
   added: (have_image star3 image3)
   goals met: 9 of 15
27. (turn_to satellite2 star4 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star4)
   goals met: 10 of 15
28. (turn_to satellite1 planet16 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet16)
   goals met: 10 of 15
29. (turn_to satellite1 star2 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star2)
   goals met: 11 of 15
30. (calibrate satellite1 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 11 of 15
31. (turn_to satellite1 planet16 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 planet16)
   goals met: 10 of 15
32. (take_image satellite1 planet16 instrument4 spectrograph2)
   added: (have_image planet16 spectrograph2)
   goals met: 11 of 15
33. (turn_to satellite1 planet5 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet5)
   goals met: 11 of 15
34. (take_image satellite1 planet5 instrument4 spectrograph2)
   added: (have_image planet5 spectrograph2)
   goals met: 12 of 15
35. (turn_to satellite1 star2 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star2)
   goals met: 13 of 15
36. (turn_to satellite1 star6 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star6)
   goals met: 12 of 15
37. (take_image satellite1 star6 instrument4 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 13 of 15
38. (turn_to satellite1 star2 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star2)
   goals met: 14 of 15
39. (turn_to satellite1 star8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star8)
   goals met: 13 of 15
40. (take_image satellite1 star8 instrument4 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 14 of 15
41. (turn_to satellite1 star2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star2)
   goals met: 15 of 15
